{
  "Logical functions": {
    "Logical.From": "Returns a logical value from a value.",
    "Logical.FromText": "Returns a logical value of true or false from a text value.",
    "Logical.ToText": "Returns a text value from a logical value."
  },
  "List functions": {
    "Information": {
      "List.Count": "Returns the number of items in a list.",
      "List.NonNullCount": "Returns the number of items in a list excluding null values",
      "List.IsEmpty": "Returns whether a list is empty."
    },
    "Selection": {
      "List.Alternate": "Returns a list with the items alternated from the original list based on a count, optional repeatInterval, and an optional offset.",
      "List.Buffer": "Buffers the list in memory. The result of this call is a stable list, which means it will have a deterministic count, and order of items.",
      "List.Distinct": "Filters a list down by removing duplicates. An optional equation criteria value can be specified to control equality comparison. The first value from each equality group is chosen.",
      "List.FindText": "Searches a list of values, including record fields, for a text value.",
      "List.First": "Returns the first value of the list or the specified default if empty. Returns the first item in the list, or the optional default value, if the list is empty. If the list is empty and a default value is not specified, the function returns.",
      "List.FirstN": "Returns the first set of items in the list by specifying how many items to return or a qualifying condition provided by `countOrCondition`.",
      "List.InsertRange": "Inserts items from values at the given index in the input list.",
      "List.IsDistinct": "Returns whether a list is distinct.",
      "List.Last": "Returns the last set of items in the list by specifying how many items to return or a qualifying condition provided by `countOrCondition`.",
      "List.LastN": "Returns the last set of items in a list by specifying how many items to return or a qualifying condition.",
      "List.MatchesAll": "Returns true if all items in a list meet a condition.",
      "List.MatchesAny": "Returns true if any item in a list meets a condition.",
      "List.Positions": "Returns a list of positions for an input list.",
      "List.Range": "Returns a count items starting at an offset.",
      "List.Select": "Selects the items that match a condition.",
      "List.Single": "Returns the single item of the list or throws an `Expression.Error` if the list has more than one item.",
      "List.SingleOrDefault": "Returns a single item from a list.",
      "List.Skip": "Skips the first item of the list. Given an empty list, it returns an empty list. This function takes an optional parameter `countOrCondition` to support skipping multiple values."
    },
    "Transformation": {
      "List.Accumulate": "Accumulates a result from the list. Starting from the initial value seed this function applies the accumulator function and returns the final result.",
      "List.Combine": "Merges a list of lists into single list.",
      "List.ConformToPageReader": "This function is intended for internal use only.",
      "List.RemoveRange": "Returns a list that removes count items starting at offset. The default count is 1.",
      "List.RemoveFirstN": "Returns a list with the specified number of elements removed from the list starting at the first element. The number of elements removed depends on the optional `countOrCondition` parameter.",
      "List.RemoveItems": "Removes items from `list1` that are present in `list2`, and returns a new list.",
      "List.RemoveLastN": "Returns a list with the specified number of elements removed from the list starting at the last element. The number of elements removed depends on the optional `countOrCondition` parameter.",
      "List.Repeat": "Returns a list that repeats the contents of an input list count times.",
      "List.ReplaceRange": "Returns a list that replaces count values in a list with a `replaceWith` list starting at an index.",
      "List.RemoveMatchingItems": "Removes all occurrences of the given values in the list.",
      "List.RemoveNulls": "Removes null values from a list.",
      "List.ReplaceMatchingItems": "Replaces occurrences of existing values in the list with new values using the provided `equationCriteria`. Old and new values are provided by the `replacements` parameters. An optional equation criteria value can be specified to control equality comparisons.",
      "List.ReplaceValue": "Searches a list of values for the value and replaces each occurrence with the replacement value.",
      "List.Reverse": "Returns a list that reverses the items in a list.",
      "List.Split": "Splits the specified list into a list of lists using the specified page size.",
      "List.Transform": "Performs the function on each item in the list and returns the new list.",
      "List.TransformMany": "Returns a list whose elements are projected from the input list."
    },
    "Membership": {
      "List.AllTrue": "Returns true if all expressions in a list are true",
      "List.AnyTrue": "Returns true if any expression in a list in true",
      "List.Contains": "Returns true if a value is found in a list.",
      "List.ContainsAll": "Returns true if all items in values are found in a list.",
      "List.ContainsAny": "Returns true if any item in values is found in a list.",
      "List.PositionOf": "Finds the first occurrence of a value in a list and returns its position.",
      "List.PositionOfAny": "Finds the first occurrence of any value in values and returns its position."
    },
    "Set operations": {
      "List.Difference": "Returns the items in list 1 that do not appear in list 2. Duplicate values are supported.",
      "List.Intersect": "Returns a list from a list of lists and intersects common items in individual lists. Duplicate values are supported.",
      "List.Union": "Returns a list from a list of lists and unions the items in the individual lists. The returned list contains all items in any input lists. Duplicate values are matched as part of the Union.",
      "List.Zip": "Returns a list of lists combining items at the same position."
    },
    "Ordering": {
      "List.Max": "Returns the maximum item in a list, or the optional default value if the list is empty.",
      "List.MaxN": "Returns the maximum values in the list. The number of values to return or a filtering condition must be specified.",
      "List.Median": "Returns the median item from a list.",
      "List.Min": "Returns the minimum item in a list, or the optional default value if the list is empty.",
      "List.MinN": "Returns the minimum values in a list. The number of values to return or a filtering condition may be specified.",
      "List.Sort": "Returns a sorted list using comparison criterion.",
      "List.Percentile": "Returns one or more sample percentiles corresponding to the given probabilities."
    },
    "Averages": {
      "List.Average": "Returns an average value from a list in the datatype of the values in the list.",
      "List.Mode": "Returns an item that appears most commonly in a list.",
      "List.Modes": "Returns all items that appear with the same maximum frequency.",
      "List.StandardDeviation": "Returns the standard deviation from a list of values. **List.StandardDeviation** performs a sample based estimate."
    },
    "Addition": {
      "List.Sum": "Returns the sum from a list."
    },
    "Numerics": {
      "List.Covariance": "Returns the covariance from two lists as a number.",
      "List.Product": "Returns the product from a list of numbers."
    },
    "Generators": {
      "List.Dates": "Returns a list of date values from size count, starting at start and adds an increment to every value.",
      "List.DateTimes": "Returns a list of datetime values from size count, starting at start and adds an increment to every value.",
      "List.DateTimeZones": "Returns a list of datetimezone values from size count, starting at start and adds an increment to every value.",
      "List.Durations": "Returns a list of durations values from size count, starting at start and adds an increment to every value.",
      "List.Generate": "Generates a list of values.",
      "List.Numbers": "Returns a list of numbers from size count starting at initial, and adds an increment. The increment defaults to 1.",
      "List.Random": "Returns a list of count random numbers, with an optional seed parameter.",
      "List.Times": "Returns a list of time values of size count, starting at start."
    }
  },
  "Lines functions": {
    "Lines.FromBinary": "Converts a binary value to a list of text values split at lines breaks.",
    "Lines.FromText": "Converts a text value to a list of text values split at lines breaks.",
    "Lines.ToBinary": "Converts a list of text into a binary value using the specified encoding and lineSeparator. The specified lineSeparator is appended to each line. If not specified then the carriage return and line feed characters are used.",
    "Lines.ToText": "Converts a list of text into a single text. The specified lineSeparator is appended to each line. If not specified then the carriage return and line feed characters are used."
  },
  "Expression functions": {
    "Expression.Constant": "Returns the M source code representation of a constant value.",
    "Expression.Evaluate": "Returns the result of evaluating an M expression.",
    "Expression.Identifier": "Returns the M source code representation of an identifier."
  },
  "Duration functions": {
    "Duration.Days": "Returns the days portion of a duration.",
    "Duration.From": "Returns a duration value from a value.",
    "Duration.FromText": "Returns a Duration value from a text value.",
    "Duration.Hours": "Returns the hours portion of a duration.",
    "Duration.Minutes": "Returns the minutes portion of a duration.",
    "Duration.Seconds": "Returns the seconds portion of a duration.",
    "Duration.ToRecord": "Returns a record with parts of a Duration value.",
    "Duration.TotalDays": "Returns the total magnitude of days from a Duration value.",
    "Duration.TotalHours": "Returns the total magnitude of hours from a Duration value.",
    "Duration.TotalMinutes": "Returns the total magnitude of minutes from a Duration value.",
    "Duration.TotalSeconds": "Returns the total magnitude of seconds from a duration value.",
    "Duration.ToText": "Returns a text value from a Duration value."
  },
  "DateTimeZone functions": {
    "DateTimeZone.FixedLocalNow": "Returns a DateTimeZone value set to the current date, time, and timezone offset on the system.",
    "DateTimeZone.FixedUtcNow": "Returns the current date and time in UTC (the GMT timezone).",
    "DateTimeZone.From": "Returns a datetimezone value from a value.",
    "DateTimeZone.FromFileTime": "Returns a DateTimeZone from a number value.",
    "DateTimeZone.FromText": "Creates a datetimezone from local, universal, and custom datetimezone formats.",
    "DateTimeZone.LocalNow": "Returns a DateTime value set to the current system date and time.",
    "DateTimeZone.RemoveZone": "Returns a datetime value with the zone information removed from the input datetimezone value.",
    "DateTimeZone.SwitchZone": "Changes the timezone information for the input DateTimeZone.",
    "DateTimeZone.ToLocal": "Returns a DateTime value from the local time zone.",
    "DateTimeZone.ToRecord": "Returns a record containing parts of a DateTime value.",
    "DateTimeZone.ToText": "Returns a text value from a DateTime value.",
    "DateTimeZone.ToUtc": "Returns a DateTime value to the Utc time zone.",
    "DateTimeZone.UtcNow": "Returns a DateTime value set to the current system date and time in the Utc timezone.",
    "DateTimeZone.ZoneHours": "Returns a time zone hour value from a DateTime value.",
    "DateTimeZone.ZoneMinutes": "Returns a time zone minute value from a DateTime value."
  },
  "DateTime functions": {
    "DateTime.AddZone": "Adds timezone information to the datetime value.",
    "DateTime.Date": "Returns a date part from a DateTime value.",
    "DateTime.FixedLocalNow": "Returns a DateTime value set to the current date and time on the system.",
    "DateTime.From": "Returns a datetime value from a value.",
    "DateTime.FromFileTime": "Returns a DateTime value from the supplied number.",
    "DateTime.FromText": "Creates a datetime from local and universal datetime formats.",
    "DateTime.IsInCurrentHour": "Indicates whether the given datetime value occurs during the current hour, as determined by the current date and time on the system.",
    "DateTime.IsInCurrentMinute": "Indicates whether the given datetime value occurs during the current minute, as determined by the current date and time on the system.",
    "DateTime.IsInCurrentSecond": "Indicates whether the given datetime value occurs during the current second, as determined by the current date and time on the system.",
    "DateTime.IsInNextHour": "Indicates whether the given datetime value occurs during the next hour, as determined by the current date and time on the system.",
    "DateTime.IsInNextMinute": "Indicates whether the given datetime value occurs during the next minute, as determined by the current date and time on the system.",
    "DateTime.IsInNextNHours": "Indicates whether the given datetime value occurs during the next number of hours, as determined by the current date and time on the system.",
    "DateTime.IsInNextNMinutes": "Indicates whether the given datetime value occurs during the next number of minutes, as determined by the current date and time on the system.",
    "DateTime.IsInNextNSeconds": "Indicates whether the given datetime value occurs during the next number of seconds, as determined by the current date and time on the system.",
    "DateTime.IsInNextSecond": "Indicates whether the given datetime value occurs during the next second, as determined by the current date and time on the system.",
    "DateTime.IsInPreviousHour": "Indicates whether the given datetime value occurs during the previous hour, as determined by the current date and time on the system.",
    "DateTime.IsInPreviousMinute": "Indicates whether the given datetime value occurs during the previous minute, as determined by the current date and time on the system.",
    "DateTime.IsInPreviousNHours": "Indicates whether the given datetime value occurs during the previous number of hours, as determined by the current date and time on the system.",
    "DateTime.IsInPreviousNMinutes": "Indicates whether the given datetime value occurs during the previous number of minutes, as determined by the current date and time on the system.",
    "DateTime.IsInPreviousNSeconds": "Indicates whether the given datetime value occurs during the previous number of seconds, as determined by the current date and time on the system.",
    "DateTime.IsInPreviousSecond": "Indicates whether the given datetime value occurs during the previous second, as determined by the current date and time on the system.",
    "DateTime.LocalNow": "Returns a datetime value set to the current date and time on the system.",
    "DateTime.Time": "Returns a time part from a DateTime value.",
    "DateTime.ToRecord": "Returns a record containing parts of a DateTime value.",
    "DateTime.ToText": "Returns a text value from a DateTime value."
  },
  "Date functions": {
    "Date.AddDays": "Returns a Date/DateTime/DateTimeZone value with the day portion incremented by the number of days provided. It also handles incrementing the month and year portions of the value as appropriate.",
    "Date.AddMonths": "Returns a DateTime value with the month portion incremented by n months.",
    "Date.AddQuarters": "Returns a Date/DateTime/DateTimeZone value incremented by the number of quarters provided. Each quarter is defined as a duration of three months. It also handles incrementing the year portion of the value as appropriate.",
    "Date.AddWeeks": "Returns a Date/DateTime/DateTimeZone value incremented by the number of weeks provided. Each week is defined as a duration of seven days. It also handles incrementing the month and year portions of the value as appropriate.",
    "Date.AddYears": "Returns a DateTime value with the year portion incremented by n years.",
    "Date.Day": "Returns the day for a DateTime value.",
    "Date.DayOfWeek": "Returns a number (from 0 to 6) indicating the day of the week of the provided value.",
    "Date.DayOfWeekName": "Returns the day of the week name.",
    "Date.DayOfYear": "Returns a number that represents the day of the year from a DateTime value.",
    "Date.DaysInMonth": "Returns the number of days in the month from a DateTime value.",
    "Date.EndOfDay": "Returns the end of the day.",
    "Date.EndOfMonth": "Returns the end of the month.",
    "Date.EndOfQuarter": "Returns the end of the quarter.",
    "Date.EndOfWeek": "Returns the end of the week.",
    "Date.EndOfYear": "Returns the end of the year.",
    "Date.From": "Returns a date value from a value.",
    "Date.FromText": "Creates a Date from local, universal, and custom Date formats.",
    "Date.IsInCurrentDay": "Indicates whether the given datetime value occurs during the current day, as determined by the current date and time on the system.",
    "Date.IsInCurrentMonth": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the current month, as determined by the current date and time on the system.",
    "Date.IsInCurrentQuarter": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the current quarter, as determined by the current date and time on the system.",
    "Date.IsInCurrentWeek": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the current week, as determined by the current date and time on the system.",
    "Date.IsInCurrentYear": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the current year, as determined by the current date and time on the system.",
    "Date.IsInNextDay": "Indicates whether the given datetime value occurs during the next day, as determined by the current date and time on the system.",
    "Date.IsInNextMonth": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the next month, as determined by the current date and time on the system.",
    "Date.IsInNextNDays": "Indicates whether the given datetime value occurs during the next number of days, as determined by the current date and time on the system.",
    "Date.IsInNextNMonths": "Indicates whether the given datetime value occurs during the next number of months, as determined by the current date and time on the system.",
    "Date.IsInNextNQuarters": "Indicates whether the given datetime value occurs during the next number of quarters, as determined by the current date and time on the system.",
    "Date.IsInNextNWeeks": "Indicates whether the given datetime value occurs during the next number of weeks, as determined by the current date and time on the system.",
    "Date.IsInNextNYears": "Indicates whether the given datetime value occurs during the next number of years, as determined by the current date and time on the system.",
    "Date.IsInNextQuarter": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the next quarter, as determined by the current date and time on the system.",
    "Date.IsInNextWeek": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the next week, as determined by the current date and time on the system.",
    "Date.IsInNextYear": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the next year, as determined by the current date and time on the system.",
    "Date.IsInPreviousDay": "Indicates whether the given datetime value occurs during the previous day, as determined by the current date and time on the system.",
    "Date.IsInPreviousMonth": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the previous month, as determined by the current date and time on the system.",
    "Date.IsInPreviousNDays": "Indicates whether the given datetime value occurs during the previous number of days, as determined by the current date and time on the system.",
    "Date.IsInPreviousNMonths": "Indicates whether the given datetime value occurs during the previous number of months, as determined by the current date and time on the system.",
    "Date.IsInPreviousNQuarters": "Indicates whether the given datetime value occurs during the previous number of quarters, as determined by the current date and time on the system.",
    "Date.IsInPreviousNWeeks": "Indicates whether the given datetime value occurs during the previous number of weeks, as determined by the current date and time on the system.",
    "Date.IsInPreviousNYears": "Indicates whether the given datetime value occurs during the previous number of years, as determined by the current date and time on the system.",
    "Date.IsInPreviousQuarter": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the previous quarter, as determined by the current date and time on the system.",
    "Date.IsInPreviousWeek": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the previous week, as determined by the current date and time on the system.",
    "Date.IsInPreviousYear": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred during the previous year, as determined by the current date and time on the system.",
    "Date.IsInYearToDate": "Returns a logical value indicating whether the given Date/DateTime/DateTimeZone occurred in the period starting January 1st of the current year and ending on the current day, as determined by the current date and time on the system.",
    "Date.IsLeapYear": "Returns a logical value indicating whether the year portion of a DateTime value is a leap year.",
    "Date.Month": "Returns the month from a DateTime value.",
    "Date.MonthName": "Returns the name of the month component.",
    "Date.QuarterOfYear": "Returns a number between 1 and 4 for the quarter of the year from a DateTime value.",
    "Date.StartOfDay": "Returns the start of the day.",
    "Date.StartOfMonth": "Returns the start of the month.",
    "Date.StartOfQuarter": "Returns the start of the quarter.",
    "Date.StartOfWeek": "Returns the start of the week.",
    "Date.StartOfYear": "Returns the start of the year.",
    "Date.ToRecord": "Returns a record containing parts of a Date value.",
    "Date.ToText": "Returns a text value from a Date value.",
    "Date.WeekOfMonth": "Returns a number for the count of week in the current month.",
    "Date.WeekOfYear": "Returns a number for the count of week in the current year.",
    "Date.Year": "Returns the year from a DateTime value."
  },
  "Comparer functions": {
    "Comparer.Equals": "Returns a logical value based on the equality check over the two given values.",
    "Comparer.FromCulture": "Returns a comparer function based on the specified culture and case-sensitivity.",
    "Comparer.Ordinal": "Returns a comparer function which uses Ordinal rules to compare values.",
    "Comparer.OrdinalIgnoreCase": "Returns a case-insensitive comparer function which uses Ordinal rules to compare the provided values x and y."
  },
  "Combiner functions": {
    "Combiner.CombineTextByDelimiter": "Returns a function that combines a list of text using the specified delimiter.",
    "Combiner.CombineTextByEachDelimiter": "Returns a function that combines a list of text using a sequence of delimiters.",
    "Combiner.CombineTextByLengths": "Returns a function that combines a list of text using the specified lengths.",
    "Combiner.CombineTextByPositions": "Returns a function that combines a list of text using the specified output positions.",
    "Combiner.CombineTextByRanges": "Returns a function that combines a list of text using the specified positions and lengths."
  },
  "Binary functions": {
    "Binary Formats": {
      "Reading numbers": {
        "BinaryFormat.7BitEncodedSignedInteger": "A binary format that reads a 64-bit signed integer that was encoded using a 7-bit variable-length encoding.",
        "BinaryFormat.7BitEncodedUnsignedInteger": "A binary format that reads a 64-bit unsigned integer that was encoded using a 7-bit variable-length encoding.",
        "BinaryFormat.Binary": "Returns a binary format that reads a binary value.",
        "BinaryFormat.Byte": "A binary format that reads an 8-bit unsigned integer.",
        "BinaryFormat.Choice": "Returns a binary format that chooses the next binary format based on a value that has already been read.",
        "BinaryFormat.Decimal": "A binary format that reads a .NET 16-byte decimal value.",
        "BinaryFormat.Double": "A binary format that reads an 8-byte IEEE double-precision floating point value.",
        "BinaryFormat.Group": "Returns a binary format that reads a group of items. Each item value is preceded by a unique key value. The result is a list of item values.",
        "BinaryFormat.Length": "Returns a binary format that limits the amount of data that can be read. Both BinaryFormat.List and BinaryFormat.Binary can be used to read until end of the data. BinaryFormat.Length can be used to limit the number of bytes that are read.",
        "BinaryFormat.List": "Returns a binary format that reads a sequence of items and returns a list.",
        "BinaryFormat.Null": "A binary format that reads zero bytes and returns null.",
        "BinaryFormat.Record": "Returns a binary format that reads a record. Each field in the record can have a different binary format.",
        "BinaryFormat.SignedInteger16": "A binary format that reads a 16-bit signed integer.",
        "BinaryFormat.SignedInteger32": "A binary format that reads a 32-bit signed integer.",
        "BinaryFormat.SignedInteger64": "A binary format that reads a 64-bit signed integer.",
        "BinaryFormat.Single": "A binary format that reads a 4-byte IEEE single-precision floating point value.",
        "BinaryFormat.Text": "Returns a binary format that reads a text value. The optional encoding value specifies the encoding of the text.",
        "BinaryFormat.Transform": "Returns a binary format that will transform the values read by another binary format.",
        "BinaryFormat.UnsignedInteger16": "A binary format that reads a 16-bit unsigned integer.",
        "BinaryFormat.UnsignedInteger32": "A binary format that reads a 32-bit unsigned integer.",
        "BinaryFormat.UnsignedInteger64": "A binary format that reads a 64-bit unsigned integer."
      },
      "Controlling byte order": {
        "BinaryFormat.ByteOrder": "Returns a binary format with the byte order specified by a function.",
        "Table.PartitionValues": "Returns information about how a table is partitioned."
      }
    },
    "Binary data": {
      "Binary.ApproximateLength": "Returns the approximate length of the binary.",
      "Binary.Buffer": "Buffers the binary value in memory. The result of this call is a stable binary value, which means it will have a deterministic length and order of bytes.",
      "Binary.Combine": "Combines a list of binaries into a single binary.",
      "Binary.Compress": "Compresses a binary value using the given compression type.",
      "Binary.Decompress": "Decompresses a binary value using the given compression type.",
      "Binary.From": "Returns a binary value from the given value.",
      "Binary.FromList": "Converts a list of numbers into a binary value",
      "Binary.FromText": "Decodes data from a text form into binary.",
      "Binary.InferContentType": "Returns a record with field Content.Type that contains the inferred MIME-type.",
      "Binary.Length": "Returns the length of binary values.",
      "Binary.Range": "Returns a subset of the binary value beginning at an offset.",
      "Binary.Split": "Splits the specified binary into a list of binaries using the specified page size.",
      "Binary.ToList": "Converts a binary value into a list of numbers",
      "Binary.ToText": "Encodes binary data into a text form.",
      "Binary.View": "Creates or extends a binary with user-defined handlers for query and action operations.",
      "Binary.ViewError": "Creates a modified error record which won't trigger a fallback when thrown by a handler defined on a view.",
      "Binary.ViewFunction": "Creates a function that can be intercepted by a handler defined on a view."
    }
  },
  "Text functions": {
    "Information": {
      "Text.InferNumberType": "Infers the granular number type (Int64.Type, Double.Type, and so on) of a number encoded in text.",
      "Text.Length": "Returns the number of characters in a text value."
    },
    "Text Comparisons": {
      "Character.FromNumber": "Converts a number to a text character.",
      "Character.ToNumber": "Converts a character to a number value.",
      "Guid.From": "Returns a `Guid.Type` value from the given `value`.",
      "Json.FromValue": "Produces a JSON representation of a given value.",
      "Text.From": "Returns the text representation of a number, date, time, datetime, datetimezone, logical, duration or binary value. If a value is null, **Text.From** returns null. The optional culture parameter is used to format the text value according to the given culture.",
      "Text.FromBinary": "Decodes data from a binary value in to a text value using an encoding.",
      "Text.NewGuid": "Returns a Guid value as a text value.",
      "Text.ToBinary": "Encodes a text value into binary value using an encoding.",
      "Text.ToList": "Returns a list of characters from a text value.",
      "Value.FromText": "Decodes a value from a textual representation, value, and interprets it as a value with an appropriate type. Value.FromText takes a text value and returns a number, a logical value, a null value, a DateTime value, a Duration value, or a text value. The empty text value is interpreted as a null value."
    },
    "Extraction": {
      "Text.At": "Returns a character starting at a zero-based offset.",
      "Text.Middle": "Returns the substring up to a specific length.",
      "Text.Range": "Returns a number of characters from a text value starting at a zero-based offset and for count number of characters.",
      "Text.Start": "Returns the count of characters from the start of a text value.",
      "Text.End": "Returns the number of characters from the end of a text value."
    },
    "Modification": {
      "Text.Insert": "Returns a text value with newValue inserted into a text value starting at a zero-based offset.",
      "Text.Remove": "Removes all occurrences of a character or list of characters from a text value. The removeChars parameter can be a character value or a list of character values.",
      "Text.RemoveRange": "Removes count characters at a zero-based offset from a text value.",
      "Text.Replace": "Replaces all occurrences of a substring with a new text value.",
      "Text.ReplaceRange": "Replaces length characters in a text value starting at a zero-based offset with the new text value.",
      "Text.Select": "Selects all occurrences of the given character or list of characters from the input text value.",
      "Text.Format": ""
    },
    "Membership": {
      "Text.Contains": "Returns true if a text value substring was found within a text value string; otherwise, false.",
      "Text.EndsWith": "Returns a logical value indicating whether a text value substring was found at the end of a string.",
      "Text.PositionOf": "Returns the first occurrence of substring in a string and returns its position starting at startOffset.",
      "Text.PositionOfAny": "Returns the first occurrence of a text value in list and returns its position starting at startOffset.",
      "Text.StartsWith": "Returns a logical value indicating whether a text value substring was found at the beginning of a string."
    },
    "Transformations": {
      "Text.AfterDelimiter": "Returns the portion of text after the specified delimiter.",
      "Text.BeforeDelimiter": "Returns the portion of text before the specified delimiter.",
      "Text.BetweenDelimiters": "Returns the portion of text between the specified startDelimiter and endDelimiter.",
      "Text.Clean": "Returns the original text value with non-printable characters removed.",
      "Text.Combine": "Returns a text value that is the result of joining all text values with each value separated by a separator.",
      "Text.Lower": "Returns the lowercase of a text value.",
      "Text.PadEnd": "Returns a text value padded at the end with pad to make it at least length characters.",
      "Text.PadStart": "Returns a text value padded at the beginning with pad to make it at least length characters. If pad is not specified, whitespace is used as pad.",
      "Text.Proper": "Returns a text value with first letters of all words converted to uppercase.",
      "Text.Repeat": "Returns a text value composed of the input text value repeated a number of times.",
      "Text.Reverse": "Reverses the provided text.",
      "Text.Split": "Returns a list containing parts of a text value that are delimited by a separator text value.",
      "Text.SplitAny": "Returns a list containing parts of a text value that are delimited by any separator text values.",
      "Text.Trim": "Removes any occurrences of characters in trimChars from text.",
      "Text.TrimEnd": "Removes any occurrences of the characters specified in trimChars from the end of the original text value.",
      "Text.TrimStart": "Removes any occurrences of the characters in trimChars from the start of the original text value.",
      "Text.Upper": "Returns the uppercase of a text value."
    }
  },
  "Splitter functions": {
    "Splitter.SplitByNothing": "Returns a function that does no splitting, returning its argument as a single element list.",
    "Splitter.SplitTextByCharacterTransition": "Returns a function that splits text into a list of text according to a transition from one kind of character to another.",
    "Splitter.SplitTextByAnyDelimiter": "Returns a function that splits text by any supported delimiter.",
    "Splitter.SplitTextByDelimiter": "Returns a function that will split text according to a delimiter.",
    "Splitter.SplitTextByEachDelimiter": "Returns a function that splits text by each delimiter in turn.",
    "Splitter.SplitTextByLengths": "Returns a function that splits text according to the specified lengths.",
    "Splitter.SplitTextByPositions": "Returns a function that splits text according to the specified positions.",
    "Splitter.SplitTextByRanges": "Returns a function that splits text according to the specified ranges.",
    "Splitter.SplitTextByRepeatedLengths": "Returns a function that splits text into a list of text after the specified length repeatedly.",
    "Splitter.SplitTextByWhitespace": "Returns a function that splits text according to whitespace."
  },
  "Replacer functions": {
    "Replacer.ReplaceText": "This function be provided to **List.ReplaceValue** or **Table.ReplaceValue** to do replace of text values in list and table values respectively.",
    "Replacer.ReplaceValue": "This function be provided to **List.ReplaceValue** or **Table.ReplaceValue** to do replace values in list and table values respectively."
  },
  "Time functions": {
    "Time.EndOfHour": "Returns the end of the hour.",
    "Time.From": "Returns a time value from a value.",
    "Time.FromText": "Creates a Time from local, universal, and custom Time formats.",
    "Time.Hour": "Returns an hour value from a DateTime value.",
    "Time.Minute": "Returns a minute value from a DateTime value.",
    "Time.Second": "Returns a second value from a DateTime value",
    "Time.StartOfHour": "Returns the start of the hour.",
    "Time.ToRecord": "Returns a record containing parts of a Date value.",
    "Time.ToText": "Returns a text value from a Time value."
  },
  "Uri functions": {
    "Uri.BuildQueryString": "Assemble a record into a URI query string.",
    "Uri.Combine": "Returns a Uri based on the combination of the base and relative parts.",
    "Uri.EscapeDataString": "Encodes special characters in accordance with RFC 3986.",
    "Uri.Parts": "Returns a record value with the fields set to the parts of a Uri text value."
  },
  "Record functions": {
    "Information": {
      "Record.FieldCount": "Returns the number of fields in a record.",
      "Record.HasFields": "Returns true if the field name or field names are present in a record."
    },
    "Transformations": {
      "Geography.FromWellKnownText": "Translates text representing a geographic value in Well-Known Text (WKT) format into a structured record.",
      "Geography.ToWellKnownText": "Translates a structured geographic point value into its Well-Known Text (WKT) representation.",
      "GeographyPoint.From": "Creates a record representing a geographic point from parts.",
      "Geometry.FromWellKnownText": "Translates text representing a geometric value in Well-Known Text (WKT) format into a structured record.",
      "Geometry.ToWellKnownText": "Translates a structured geometric point value into its Well-Known Text (WKT) representation.",
      "GeometryPoint.From": "Creates a record representing a geometric point from parts.",
      "Record.AddField": "Adds a field from a field name and value.",
      "Record.Combine": "Combines the records in a list.",
      "Record.RemoveFields": "Returns a new record that reorders the given fields with respect to each other. Any fields not specified remain in their original locations.",
      "Record.RenameFields": "Returns a new record that renames the fields specified. The resultant fields will retain their original order. This function supports swapping and chaining field names. However, all target names plus remaining field names must constitute a unique set or an error will occur.",
      "Record.ReorderFields": "Returns a new record that reorders fields relative to each other. Any fields not specified remain in their original locations. Requires two or more fields.",
      "Record.TransformFields": "Transforms fields by applying transformOperations. For more information about values supported by transformOperations."
    },
    "Selection": {
      "Record.Field": "Returns the value of the given field. This function can be used to dynamically create field lookup syntax for a given record. In that way it is a dynamic version of the record[field] syntax.",
      "Record.FieldNames": "Returns a list of field names in order of the record's fields.",
      "Record.FieldOrDefault": "Returns the value of a field from a record, or the default value if the field does not exist.",
      "Record.FieldValues": "Returns a list of field values in order of the record's fields.",
      "Record.SelectFields": "Returns a new record that contains the fields selected from the input record. The original order of the fields is maintained."
    },
    "Serialization": {
      "Record.FromList": "Returns a record given a list of field values and a set of fields.",
      "Record.FromTable": "Returns a record from a table of records containing field names and values.",
      "Record.ToList": "Returns a list of values containing the field values of the input record.",
      "Record.ToTable": "Returns a table of records containing field names and values from an input record."
    }
  },
  "Number functions": {
    "Information": {
      "Number.IsEven": "Returns true if a value is an even number.",
      "Number.IsNaN": "Returns true if a value is Number.NaN.",
      "Number.IsOdd": "Returns true if a value is an odd number."
    },
    "Conversion and formatting": {
      "Byte.From": "Returns an 8-bit integer number value from the given value.",
      "Currency.From": "Returns a currency value from the given value.",
      "Decimal.From": "Returns a decimal number value from the given value.",
      "Double.From": "Returns a Double number value from the given value.",
      "Int8.From": "Returns a signed 8-bit integer number value from the given value.",
      "Int16.From": "Returns a 16-bit integer number value from the given value.",
      "Int32.From": "Returns a 32-bit integer number value from the given value.",
      "Int64.From": "Returns a 64-bit integer number value from the given value.",
      "Number.From": "Returns a number value from a value.",
      "Number.FromText": "Returns a number value from a text value.",
      "Number.ToText": "Converts the given number to text.",
      "Percentage.From": "Returns a percentage value from the given value.",
      "Single.From": "Returns a Single number value from the given value."
    },
    "Rounding": {
      "Number.Round": "Returns a nullable number (n) if value is an integer.",
      "Number.RoundAwayFromZero": "Returns Number.RoundUp(value) when value >= 0 and Number.RoundDown(value) when value < 0.",
      "Number.RoundDown": "Returns the largest integer less than or equal to a number value.",
      "Number.RoundTowardZero": "Returns Number.RoundDown(x) when x >= 0 and Number.RoundUp(x) when x < 0.",
      "Number.RoundUp": "Returns the larger integer greater than or equal to a number value."
    },
    "Operations": {
      "Number.Abs": "Returns the absolute value of a number.",
      "Number.Combinations": "Returns the number of combinations of a given number of items for the optional combination size.",
      "Number.Exp": "Returns a number representing e raised to a power.",
      "Number.Factorial": "Returns the factorial of a number.",
      "Number.IntegerDivide": "Divides two numbers and returns the whole part of the resulting number.",
      "Number.Ln": "Returns the natural logarithm of a number.",
      "Number.Log": "Returns the logarithm of a number to the base.",
      "Number.Log10": "Returns the base-10 logarithm of a number.",
      "Number.Mod": "Divides two numbers and returns the remainder of the resulting number.",
      "Number.Permutations": "Returns the number of total permutations of a given number of items for the optional permutation size.",
      "Number.Power": "Returns a number raised by a power.",
      "Number.Sign": "Returns 1 for positive numbers, -1 for negative numbers or 0 for zero.",
      "Number.Sqrt": "Returns the square root of a number."
    },
    "Random": {
      "Number.Random": "Returns a random fractional number between 0 and 1.",
      "Number.RandomBetween": "Returns a random number between the two given number values."
    },
    "Trigonometry": {
      "Number.Acos": "Returns the arccosine of a number.",
      "Number.Asin": "Returns the arcsine of a number.",
      "Number.Atan": "Returns the arctangent of a number.",
      "Number.Atan2": "Returns the arctangent of the division of two numbers.",
      "Number.Cos": "Returns the cosine of a number.",
      "Number.Cosh": "Returns the hyperbolic cosine of a number.",
      "Number.Sin": "Returns the sine of a number.",
      "Number.Sinh": "Returns the hyperbolic sine of a number.",
      "Number.Tan": "Returns the tangent of a number.",
      "Number.Tanh": "Returns the hyperbolic tangent of a number."
    },
    "Bytes": {
      "Number.BitwiseAnd": "Returns the result of a bitwise AND operation on the provided operands.",
      "Number.BitwiseNot": "Returns the result of a bitwise NOT operation on the provided operands.",
      "Number.BitwiseOr": "Returns the result of a bitwise OR operation on the provided operands.",
      "Number.BitwiseShiftLeft": "Returns the result of a bitwise shift left operation on the operands.",
      "Number.BitwiseShiftRight": "Returns the result of a bitwise shift right operation on the operands.",
      "Number.BitwiseXor": "Returns the result of a bitwise XOR operation on the provided operands."
    }
  },
  "Value functions": {
    "General Operations": {
      "Value.Alternates": "Expresses alternate query plans.",
      "Value.Compare": "Returns -1, 0, or 1 based on whether the first value is less than, equal to, or greater than the second.",
      "Value.Equals": "Returns whether two values are equal.",
      "Value.Expression": "Returns an abstract syntax tree (AST) that represents the value's expression.",
      "Value.VersionIdentity": "Returns the version identity of a value.",
      "Value.Versions": "Returns a navigation table containing the available versions of a value.",
      "Value.NativeQuery": "Evaluates a query against a target.",
      "Value.NullableEquals": "Returns a logical value or null based on two values.",
      "Value.Optimize": "If value represents a query that can be optimized, returns the optimized query. Otherwise returns value.",
      "Value.Type": "Returns the type of the given value."
    },
    "Arithmetic Operations": {
      "Value.Add": "Returns the sum of the two values.",
      "Value.Divide": "Returns the result of dividing the first value by the second.",
      "Value.Multiply": "Returns the product of the two values.",
      "Value.Subtract": "Returns the difference of the two values."
    },
    "Parameter Types": {
      "Value.As": "Returns the value if it is compatible with the specified type.",
      "Value.Is": "Determines whether a value is compatible with the specified type.",
      "Value.ReplaceType": "Replaces the value's type."
    },
    "Implementation": {
      "Action.WithErrorContext": "This function is intended for internal use only.",
      "DirectQueryCapabilities.From": "This function is intended for internal use only.",
      "Embedded.Value": "Accesses a value by name in an embedded mashup.",
      "Excel.ShapeTable": "This function is intended for internal use only.",
      "Progress.DataSourceProgress": "This function is intended for internal use only.",
      "SqlExpression.SchemaFrom": "This function is intended for internal use only.",
      "SqlExpression.ToExpression": "This function is intended for internal use only.",
      "Value.Firewall": "This function is intended for internal use only.",
      "Value.ViewError": "This function is intended for internal use only.",
      "Value.ViewFunction": "This function is intended for internal use only.",
      "Variable.Value": "This function is intended for internal use only."
    },
    "Metadata": {
      "Value.Metadata": "Returns a record containing the input’s metadata.",
      "Value.RemoveMetadata": "Removes the metadata on the value and returns the original value.",
      "Value.ReplaceMetadata": "Replaces the metadata on a value with the new metadata record provided and returns the original value with the new metadata attached."
    },
    "Lineage": {
      "Graph.Nodes": "This function is intended for internal use only.",
      "Value.Lineage": "This function is intended for internal use only.",
      "Value.Traits": "This function is intended for internal use only."
    }
  },
  "Type functions": {
    "Type.AddTableKey": "Add a key to a table type.",
    "Type.ClosedRecord": "The given type must be a record type returns a closed version of the given record type (or the same type, if it is already closed)",
    "Type.Facets": "Returns the facets of a type.",
    "Type.ForFunction": "Creates a function type from the given .",
    "Type.ForRecord": "Returns a Record type from a fields record.",
    "Type.FunctionParameters": "Returns a record with field values set to the name of the parameters of a function type, and their values set to their corresponding types.",
    "Type.FunctionRequiredParameters": "Returns a number indicating the minimum number of parameters required to invoke the a type of function.",
    "Type.FunctionReturn": "Returns a type returned by a function type.",
    "Type.Is": "Determines if a value of the first type is always compatible with the second type.",
    "Type.IsNullable": "Returns true if a type is a nullable type; otherwise, false.",
    "Type.IsOpenRecord": "Returns whether a record type is open.",
    "Type.ListItem": "Returns an item type from a list type.",
    "Type.NonNullable": "Returns the non nullable type from a type.",
    "Type.OpenRecord": "Returns an opened version of a record type, or the same type, if it is already open.",
    "Type.RecordFields": "Returns a record describing the fields of a record type with each field of the returned record type having a corresponding name and a value that is a record of the form `[ Type = type, Optional = logical ]`.",
    "Type.ReplaceFacets": "Replaces the facets of a type.",
    "Type.ReplaceTableKeys": "Replaces the keys in a table type.",
    "Type.TableColumn": "Returns the type of a column in a table.",
    "Type.TableKeys": "Returns keys from a table type.",
    "Type.TableRow": "Returns a row type from a table type.",
    "Type.TableSchema": "Returns a table containing a description of the columns (i.e., the schema) of the specified table type.",
    "Type.Union": "Returns the union of a list of types."
  },
  "Table functions": {
    "Table construction": {
      "ItemExpression.From": "Returns the abstract syntax tree (AST) for the body of a function.",
      "ItemExpression.Item": "An abstract syntax tree (AST) node representing the item in an item expression.",
      "RowExpression.Column": "Returns an abstract syntax tree (AST) that represents access to a column within a row expression.",
      "RowExpression.From": "Returns the abstract syntax tree (AST) for the body of a function.",
      "RowExpression.Row": "An abstract syntax tree (AST) node representing the row in a row expression.",
      "Table.FromColumns": "Returns a table from a list containing nested lists with the column names and values.",
      "Table.FromList": "Converts a list into a table by applying the specified splitting function to each item in the list.",
      "Table.FromRecords": "Returns a table from a list of records.",
      "Table.FromRows": "Creates a table from the list where each element of the list is a list that contains the column values for a single row.",
      "Table.FromValue": "Returns a table with a column containing the provided value or list of values.",
      "Table.FuzzyGroup": "Groups the rows of a table by fuzzily matching values in the specified column for each row.",
      "Table.FuzzyJoin": "Joins the rows from the two tables that fuzzy match based on the given keys.",
      "Table.FuzzyNestedJoin": "Performs a fuzzy join between tables on supplied columns and produces the join result in a new column.",
      "Table.Split": "Splits the specified table into a list of tables using the specified page size.",
      "Table.WithErrorContext": "This function is intended for internal use only.",
      "Table.View": "Creates or extends a table with user-defined handlers for query and action operations.",
      "Table.ViewError": "Creates a modified error record which won't trigger a fallback when thrown by a handler defined on a view.",
      "Table.ViewFunction": "Creates a function that can be intercepted by a handler defined on a view."
    },
    "Conversions": {
      "Table.ToColumns": "Returns a list of nested lists each representing a column of values in the input table.",
      "Table.ToList": "Returns a table into a list by applying the specified combining function to each row of values in a table.",
      "Table.ToRecords": "Returns a list of records from an input table.",
      "Table.ToRows": "Returns a nested list of row values from an input table."
    },
    "Information": {
      "Table.ApproximateRowCount": "Returns the approximate number of rows in the table.",
      "Table.ColumnCount": "Returns the number of columns in a table.",
      "Table.IsEmpty": "Returns true if the table does not contain any rows.",
      "Table.Profile": "Returns a profile of the columns of a table.",
      "Table.RowCount": "Returns the number of rows in a table.",
      "Table.Schema": "Returns a table containing a description of the columns of the specified table.",
      "Tables.GetRelationships": "Returns the relationships among a set of tables."
    },
    "Row operations": {
      "Table.AlternateRows": "Returns a table containing an alternating pattern of the rows from a table.",
      "Table.Combine": "Returns a table that is the result of merging a list of tables. The tables must all have the same row type structure.",
      "Table.FindText": "Returns a table containing only the rows that have the specified text within one of their cells or any part thereof.",
      "Table.First": "Returns the first row from a table.",
      "Table.FirstN": "Returns the first row(s) of a table, depending on the countOrCondition parameter.",
      "Table.FirstValue": "Returns the first column of the first row of the table or a specified default value.",
      "Table.FromPartitions": "Returns a table that is the result of combining a set of partitioned tables into new columns.",
      "Table.InsertRows": "Returns a table with the list of rows inserted into the table at an index.",
      "Table.Last": "Returns the last row of a table.",
      "Table.LastN": "Returns the last row(s) from a table, depending on the countOrCondition parameter.",
      "Table.MatchesAllRows": "Returns true if all of the rows in a table meet a condition.",
      "Table.MatchesAnyRows": "Returns true if any of the rows in a table meet a condition.",
      "Table.Partition": "Partitions the table into a list of groups number of tables, based on the value of the column of each row and a hash function.",
      "Table.PartitionValues": "Returns information about how a table is partitioned.",
      "Table.Range": "Returns the specified number of rows from a table starting at an offset.",
      "Table.RemoveFirstN": "Returns a table with the specified number of rows removed from the table starting at the first row.",
      "Table.RemoveLastN": "Returns a table with the specified number of rows removed from the table starting at the last row.",
      "Table.RemoveRows": "Returns a table with the specified number of rows removed from the table starting at an offset.",
      "Table.RemoveRowsWithErrors": "Returns a table with all rows removed from the table that contain an error in at least one of the cells in a row.",
      "Table.Repeat": "Returns a table containing the rows of the table repeated the count number of times.",
      "Table.ReplaceRows": "Returns a table where the rows beginning at an offset and continuing for count are replaced with the provided rows.",
      "Table.ReverseRows": "Returns a table with the rows in reverse order.",
      "Table.SelectRows": "Returns a table containing only the rows that match a condition.",
      "Table.SelectRowsWithErrors": "Returns a table with only the rows from table that contain an error in at least one of the cells in a row.",
      "Table.SingleRow": "Returns a single row from a table.",
      "Table.Skip": "Returns a table that does not contain the first row or rows of the table.",
      "Table.SplitAt": "Returns a list containing the first count rows specified and the remaining rows."
    },
    "Column operations": {
      "Table.Column": "Returns the values from a column in a table.",
      "Table.ColumnNames": "Returns the names of columns from a table.",
      "Table.ColumnsOfType": "Returns a list with the names of the columns that match the specified types.",
      "Table.DemoteHeaders": "Demotes the header row down into the first row of a table.",
      "Table.DuplicateColumn": "Duplicates a column with the specified name. Values and type are copied from the source column.",
      "Table.HasColumns": "Indicates whether the table contains the specified column(s).",
      "Table.Pivot": "Given a table and attribute column containing pivotValues, creates new columns for each of the pivot values and assigns them values from the valueColumn.",
      "Table.PrefixColumns": "Returns a table where the columns have all been prefixed with a text value.",
      "Table.PromoteHeaders": "Promotes the first row of the table into its header or column names.",
      "Table.RemoveColumns": "Returns a table without a specific column or columns.",
      "Table.ReorderColumns": "Returns a table with specific columns in an order relative to one another.",
      "Table.RenameColumns": "Returns a table with the columns renamed as specified.",
      "Table.SelectColumns": "Returns a table that contains only specific columns.",
      "Table.TransformColumnNames": "Transforms column names by using the given function.",
      "Table.Unpivot": "Given a list of table columns, transforms those columns into attribute-value pairs.",
      "Table.UnpivotOtherColumns": "Translates all columns other than a specified set into attribute-value pairs, combined with the rest of the values in each row."
    },
    "Transformation": {
      "Table.AddColumn": "Adds a column named newColumnName to a table.",
      "Table.AddFuzzyClusterColumn": "Adds a new column with representative values obtained by fuzzy grouping values of the specified column in the table.",
      "Table.AddIndexColumn": "Returns a table with a new column with a specific name that, for each row, contains an index of the row in the table.",
      "Table.AddJoinColumn": "Performs a nested join between table1 and table2 from specific columns and produces the join result as a newColumnName column for each row of table1.",
      "Table.AddKey": "Adds a key to table.",
      "Table.AggregateTableColumn": "Aggregates tables nested in a specific column into multiple columns containing aggregate values for those tables.",
      "Table.CombineColumns": "Table.CombineColumns merges columns using a combiner function to produce a new column.",
      "Table.CombineColumnsToRecord": "Combines the specified columns into a new record-valued column where each record has field names and values corresponding to the column names and values of the columns that were combined.",
      "Table.ConformToPageReader": "This function is intended for internal use only.",
      "Table.ExpandListColumn": "Given a column of lists in a table, create a copy of a row for each value in its list.",
      "Table.ExpandRecordColumn": "Expands a column of records into columns with each of the values.",
      "Table.ExpandTableColumn": "Expands a column of records or a column of tables into multiple columns in the containing table.",
      "Table.FillDown": "Replaces null values in the specified column or columns of the table with the most recent non-null value in the column.",
      "Table.FillUp": "Returns a table from the table specified where the value of the next cell is propagated to the null values cells above in the column specified.",
      "Table.FilterWithDataTable": "This function is intended for internal use only.",
      "Table.Group": "Groups table rows by the values of key columns for each row.",
      "Table.Join": "Joins the rows of table1 with the rows of table2 based on the equality of the values of the key columns selected by table1, key1 and table2, key2.",
      "Table.Keys": "Returns the keys of the specified table.",
      "Table.NestedJoin": "Joins the rows of the tables based on the equality of the keys. The results are entered into a new column.",
      "Table.ReplaceErrorValues": "Replaces the error values in the specified columns with the corresponding specified value.",
      "Table.ReplaceKeys": "Replaces the keys of the specified table.",
      "Table.ReplaceRelationshipIdentity": "This function is intended for internal use only.",
      "Table.ReplaceValue": "Replaces oldValue with newValue in specific columns of a table, using the provided replacer function, such as text.Replace or Value.Replace.",
      "Table.SplitColumn": "Returns a new set of columns from a single column applying a splitter function to each value.",
      "Table.TransformColumns": "Transforms the values of one or more columns.",
      "Table.TransformColumnTypes": "Transforms the column types from a table using a type.",
      "Table.TransformRows": "Transforms the rows from a table using a transform function.",
      "Table.Transpose": "Returns a table with columns converted to rows and rows converted to columns from the input table."
    },
    "Membership": {
      "Table.Contains": "Determines whether the a record appears as a row in the table.",
      "Table.ContainsAll": "Determines whether all of the specified records appear as rows in the table.",
      "Table.ContainsAny": "Determines whether any of the specified records appear as rows in the table.",
      "Table.Distinct": "Removes duplicate rows from a table, ensuring that all remaining rows are distinct.",
      "Table.IsDistinct": "Determines whether a table contains only distinct rows.",
      "Table.PositionOf": "Determines the position or positions of a row within a table.",
      "Table.PositionOfAny": "Determines the position or positions of any of the specified rows within the table.",
      "Table.RemoveMatchingRows": "Removes all occurrences of rows from a table.",
      "Table.ReplaceMatchingRows": "Replaces specific rows from a table with the new rows."
    },
    "Ordering": {
      "Table.Max": "Returns the largest row or rows from a table using a comparisonCriteria.",
      "Table.MaxN": "Returns the largest N rows from a table.",
      "Table.Min": "Returns the smallest row or rows from a table using a comparisonCriteria.",
      "Table.MinN": "Returns the smallest N rows in the given table.",
      "Table.AddRankColumn": "Appends a column with the ranking of one or more other columns.",
      "Table.Sort": "Sorts the rows in a table using a comparisonCriteria or a default ordering if one is not specified."
    },
    "Other": {
      "Table.Buffer": "Buffers a table into memory, isolating it from external changes during evaluation.",
      "Table.OnError": "",
      "Table.StopFolding": ""
    }
  },
  "Accessing data functions": {
    "AccessControlEntry.ConditionToIdentities": "Returns a list of identities that the condition will accept.",
    "Access.Database": "Returns a structural representation of a Microsoft Access database.",
    "ActiveDirectory.Domains": "Returns a list of Active Directory domains in the same forest as the specified domain or of the current machine's domain if none is specified.",
    "AdobeAnalytics.Cubes": "Returns the report suites in Adobe Analytics.",
    "AdoDotNet.DataSource": "Returns the schema collection for an ADO.NET data source.",
    "AdoDotNet.Query": "Returns the schema collection for an ADO.NET data source.",
    "AnalysisServices.Database": "Returns a table of multidimensional cubes or tabular models from the Analysis Services database.",
    "AnalysisServices.Databases": "Returns the Analysis Services databases on a particular host.",
    "AzureStorage.BlobContents": "Returns the content of the specified blob from an Azure storage vault.",
    "AzureStorage.Blobs": "Returns a navigational table containing all containers found in the Azure Storage account. Each row has the container name and a link to the container blobs.",
    "AzureStorage.DataLake": "Returns a navigational table containing the documents found in the specified container and its subfolders from Azure Data Lake Storage.",
    "AzureStorage.DataLakeContents": "Returns the content of the specified file from an Azure Data Lake Storage filesystem.",
    "AzureStorage.Tables": "Returns a navigational table containing a row for each table found at the account URL from an Azure storage vault. Each row contains a link to the azure table.",
    "Cdm.Contents": "This function is unavailable because it requires .NET 4.5.",
    "Csv.Document": "Returns the contents of a CSV document as a table using the specified encoding.",
    "Cube.AddAndExpandDimensionColumn": "Merges the specified dimension table, dimensionSelector, into the cube's, cube, filter context and changes the dimensional granularity by expanding the specified set, attributeNames, of dimension attributes.",
    "Cube.AddMeasureColumn": "Adds a column with the name column to the cube that contains the results of the measure measureSelector applied in the row context of each row.",
    "Cube.ApplyParameter": "Returns a cube after applying parameter with arguments to cube.",
    "Cube.AttributeMemberId": "Returns the unique member identifier from a member property value.",
    "Cube.AttributeMemberProperty": "Returns the property `propertyName` of dimension attribute `attribute`.",
    "Cube.CollapseAndRemoveColumns": "Changes the dimensional granularity of the filter context for the cube by collapsing the attributes mapped to the specified columns columnNames.",
    "Cube.Dimensions": "Returns a table containing the set of available dimensions within the cube.",
    "Cube.DisplayFolders": "Returns a nested tree of tables representing the display folder hierarchy of the objects (for example, dimensions and measures).",
    "Cube.MeasureProperties": "Returns a table containing the set of available properties for measures that are expanded in the cube.",
    "Cube.MeasureProperty": "Returns the property of a measure.",
    "Cube.Measures": "Returns a table containing the set of available measures within the cube.",
    "Cube.Parameters": "Returns a table containing the set of parameters that can be applied to cube.",
    "Cube.Properties": "Returns a table containing the set of available properties for dimensions that are expanded in the cube.",
    "Cube.PropertyKey": "Returns the key of property `property`.",
    "Cube.ReplaceDimensions": "Replaces the set of dimensions returned by **Cube.Dimensions.**",
    "Cube.Transform": "Applies the list cube functions, transforms, on the cube.",
    "DB2.Database": "Returns a table of SQL tables and views available in a Db2 database.",
    "DeltaLake.Table": "Returns the contents of the Delta Lake table.",
    "Essbase.Cubes": "Returns the cubes in an Essbase instance grouped by Essbase server.",
    "Excel.CurrentWorkbook": "Returns the tables in the current Excel Workbook.",
    "Excel.Workbook": "Returns a table representing sheets in the given excel workbook.",
    "Exchange.Contents": "Returns a table of contents from a Microsoft Exchange account.",
    "File.Contents": "Returns the binary contents of the file located at a path.",
    "Folder.Contents": "Returns a table containing the properties and contents of the files and folders found in the specified folder.",
    "Folder.Files": "Returns a table containing a row for each file found at a folder path, and subfolders. Each row contains properties of the folder or file and a link to its content.",
    "GoogleAnalytics.Accounts": "Returns the Google Analytics accounts for the current credential.",
    "Hdfs.Contents": "Returns a table containing a row for each folder and file found at the folder url, {0}, from a Hadoop file system. Each row contains properties of the folder or file and a link to its content.",
    "Hdfs.Files": "Returns a table containing a row for each file found at the folder url, {0}, and subfolders from a Hadoop file system. Each row contains properties of the file and a link to its content.",
    "HdInsight.Containers": "Returns a navigational table containing all containers found in the HDInsight account. Each row has the container name and table containing its files.",
    "HdInsight.Contents": "Returns a navigational table containing all containers found in the HDInsight account. Each row has the container name and table containing its files.",
    "HdInsight.Files": "Returns a table containing a row for each folder and file found at the container URL, and subfolders from an HDInsight account. Each row contains properties of the file/folder and a link to its content.",
    "Html.Table": "Returns a table containing the results of running the specified CSS selectors against the provided HTML.",
    "Identity.From": "Creates an identity.",
    "Identity.IsMemberOf": "Determines whether an identity is a member of an identity collection.",
    "IdentityProvider.Default": "The default identity provider for the current host.",
    "Informix.Database": "Returns a table of SQL tables and views available in an Informix database on server `server` in the database instance named `database`.",
    "Json.Document": "Returns the contents of a JSON document. The contents may be directly passed to the function as text, or it may be the binary value returned by a function like File.Contents.",
    "Json.FromValue": "Produces a JSON representation of a given value value with a text encoding specified by encoding.",
    "MySQL.Database": "Returns a table with data relating to the tables in the specified MySQL Database.",
    "OData.Feed": "Returns a table of OData feeds offered by an OData serviceUri.",
    "Odbc.DataSource": "Returns a table of SQL tables and views from the ODBC data source specified by the connection string `connectionString`.",
    "Odbc.InferOptions": "Returns the result of trying to infer SQL capabilities for an ODBC driver.",
    "Odbc.Query": "Connects to a generic provider with the given connection string and returns the result of evaluating the query.",
    "OleDb.DataSource": "Returns a table of SQL tables and views from the OLE DB data source specified by the connection string.",
    "OleDb.Query": "Returns the result of running a native query on an OLE DB data source.",
    "Oracle.Database": "Returns a table with data relating to the tables in the specified Oracle Database.",
    "Pdf.Tables": "Returns any tables found in a PDF file.",
    "PostgreSQL.Database": "Returns a table with data relating to the tables in the specified PostgreSQL Database.",
    "RData.FromBinary": "Returns a record of data frames from the RData file.",
    "Salesforce.Data": "Connects to the Salesforce Objects API and returns the set of available objects (i.e. Accounts).",
    "Salesforce.Reports": "Connects to the Salesforce Reports API and returns the set of available reports.",
    "SapBusinessWarehouse.Cubes": "Returns the InfoCubes and queries in an SAP Business Warehouse system grouped by InfoArea.",
    "SapHana.Database": "Returns the packages in an SAP HANA database.",
    "SharePoint.Contents": "Returns a table containing a row for each folder and document found at the SharePoint site url. Each row contains properties of the folder or file and a link to its content.",
    "SharePoint.Files": "Returns a table containing a row for each document found at the SharePoint site url, and subfolders. Each row contains properties of the folder or file and a link to its content.",
    "SharePoint.Tables": "Returns a table containing the result of a SharePoint List as an OData feed.",
    "Soda.Feed": "Returns the resulting table of a CSV file that can be accessed using the SODA 2.0 API. The URL must point to a valid SODA-compliant source that ends in a .csv extension.",
    "Sql.Database": "Returns a table containing SQL tables located on a SQL Server instance database.",
    "Sql.Databases": "Returns a table with references to databases located on a SQL Server instance. Returns a navigation table.",
    "Sybase.Database": "Returns a table with data relating to the tables in the specified Sybase Database.",
    "Teradata.Database": "Returns a table with data relating to the tables in the specified Teradata Database.",
    "WebAction.Request": "Creates an action that, when executed, will return the results of performing a method request against url using HTTP as a binary value.",
    "Web.BrowserContents": "Returns the HTML for the specified URL, as viewed by a web browser.",
    "Web.Contents": "Returns the contents downloaded from a web URL as a binary value.",
    "Web.Headers": "Returns the HTTP headers downloaded from the URL as a record value.",
    "Web.Page": "Returns the contents of an HTML webpage as a table.",
    "Xml.Document": "Returns the contents of an XML document as a hierarchical table (list of records).",
    "Xml.Tables": "Returns the contents of an XML document as a nested collection of flattened tables.",
    "AmazonRedshift.Database": "",
    "AML.Execute": "",
    "AML.ExecuteBatch": "",
    "ApacheHiveLLAP.Database": "",
    "ApacheSpark.Tables": "",
    "appFigures.Content": "",
    "appFigures.Tables": "",
    "AzureDataExplorer.Contents": "",
    "AzureDataExplorer.Databases": "",
    "AzureDevOpsServer.AccountContents": "",
    "AzureDevOpsServer.AnalyticsViews": "",
    "AzureDevOpsServer.Feed": "",
    "AzureDevOpsServer.Views": "",
    "AzureEnterprise.Contents": "",
    "AzureEnterprise.Tables": "",
    "AzureHiveLLAP.Database": "",
    "AzureMLFunctions.Contents": "",
    "AzureMLFunctions.Execute": "",
    "AzureMLFunctions.ExecuteBatch": "",
    "AzureSpark.Tables": "",
    "Cdm.MapToEntity": "",
    "Cds.Contents": "",
    "Cds.Entities": "",
    "DataLake.Contents": "",
    "DataLake.Files": "",
    "DataWorld.Contents": "",
    "DataWorld.Dataset": "",
    "DocumentDB.Contents": "",
    "Dynamics365BusinessCentral.ApiContents": "",
    "Dynamics365BusinessCentral.ApiContentsWithOptions": "",
    "Dynamics365BusinessCentral.Contents": "",
    "Dynamics365BusinessCentral.EnvironmentContents": "",
    "Dynamics365BusinessCentralOnPremises.Contents": "",
    "DynamicsNav.Contents": "",
    "Github.Contents": "",
    "Github.PagedTable": "",
    "Github.Tables": "",
    "GoogleBigQuery.Database": "",
    "GoogleBigQueryAad.Database": "",
    "Impala.Database": "",
    "Kusto.Contents": "",
    "Kusto.Databases": "",
    "LinkedIn.SalesContracts": "",
    "LinkedIn.SalesContractsWithReportAccess": "",
    "LinkedIn.SalesNavigator": "",
    "LinkedIn.SalesNavigatorAnalytics": "",
    "LinkedIn.SalesNavigatorAnalyticsImpl": "",
    "MailChimp.Collection": "",
    "MailChimp.Instance": "",
    "MailChimp.Tables": "",
    "MailChimp.TablesV2": "",
    "Marketo.Activities": "",
    "Marketo.Leads": "",
    "Marketo.Tables": "",
    "MicrosoftAzureConsumptionInsights.Contents": "",
    "MicrosoftAzureConsumptionInsights.Tables": "",
    "MicrosoftAzureConsumptionInsights.Test": "",
    "Mixpanel.Contents": "",
    "Mixpanel.Export": "",
    "Mixpanel.FunnelById": "",
    "Mixpanel.FunnelByName": "",
    "Mixpanel.Funnels": "",
    "Mixpanel.Segmentation": "",
    "Mixpanel.Tables": "",
    "Netezza.Database": "",
    "Parquet.Document": "",
    "Parquet.Metadata": "",
    "PlanviewEnterprise.CallQueryService": "",
    "PlanviewEnterprise.Feed": "",
    "PowerBI.Dataflows": "",
    "Projectplace.Feed": "",
    "Python.Execute": "",
    "QuickBooks.Query": "",
    "QuickBooks.Report": "",
    "QuickBooks.Tables": "",
    "QuickBooksOnline.Tables": "",
    "R.Execute": "",
    "Smartsheet.Content": "",
    "Smartsheet.Query": "",
    "Smartsheet.Tables": "",
    "Snowflake.Databases": "",
    "Spark.Tables": "",
    "SparkPost.GetList": "",
    "SparkPost.GetTable": "",
    "SparkPost.NavTable": "",
    "Stripe.Contents": "",
    "Stripe.Method": "",
    "Stripe.Tables": "",
    "SweetIQ.Contents": "",
    "SweetIQ.Tables": "",
    "Troux.CustomFeed": "",
    "Troux.Feed": "",
    "Troux.TestConnection": "",
    "Twilio.Contents": "",
    "Twilio.Tables": "",
    "Twilio.URL": "",
    "Vertica.Database": "",
    "VSTS.AccountContents": "",
    "VSTS.AnalyticsViews": "",
    "VSTS.Contents": "",
    "VSTS.Feed": "",
    "VSTS.Views": "",
    "Webtrends.KeyMetrics": "",
    "Webtrends.Profile": "",
    "Webtrends.ReportContents": "",
    "Webtrends.Tables": "",
    "Zendesk.Collection": "",
    "Zendesk.Tables": ""
  },
  "Function values": {
    "Function.From": "Takes a unary function `function` and creates a new function with the type `functionType` that constructs a list out of its arguments and passes it to `function`.",
    "Function.Invoke": "Invokes the given function using the specified and returns the result.",
    "Function.InvokeAfter": "Returns the result of invoking function after duration delay has passed.",
    "Function.InvokeWithErrorContext": "This function is intended for internal use only.",
    "Function.IsDataSource": "Returns whether or not function is considered a data source.",
    "Function.ScalarVector": "Returns a scalar function of type scalarFunctionType that invokes vectorFunction with a single row of arguments and returns its single output."
  },
  "Error handling functions": {
    "Diagnostics.ActivityId": "Returns an opaque identifier for the currently-running evaluation.",
    "Diagnostics.CorrelationId": "Returns an opaque identifier to correlate incoming requests with outgoing ones.",
    "Diagnostics.Trace": "Writes a trace message, if tracing is enabled, and returns value.",
    "Error.Record": "Returns a record containing fields **Reason**, **Message**, and **Detail** set to the provided values. The record can be used to raise or throw an error."
  },
  "AI functions": {
    "AI.ExecuteInProc": "",
    "AI.ExecuteInternal": "",
    "AI.ExternalSort": "",
    "AI.GetAutoMLEntity": "",
    "AI.SampleStratifiedWithHoldout": "",
    "AI.TestConnection": "",
    "AIFunctions.Capacities": "",
    "AIFunctions.Contents": "",
    "AIFunctions.ExecuteInternal": "",
    "AIFunctions.GetAutoMLEntity": "",
    "AIFunctions.PostProcess": "",
    "AIInsights.Contents": "",
    "AIInsights.ContentsGenerator": ""
  },
  "Other functions":{
    "Resource.Access":"",
    "Value.ResourceExpression":""
  }
}